<template>
   <div class="history-index">
     <div>详情页</div>
     <router-link :to="'/history/list'">点击返回列表页</router-link>
     <div>
       2004-1-14 17:04:25
 又准备过年了,时间过得真是很快啊,许多人可能与我一样从这个时候就开始紧张了,真是年年难过年年过,每过一次年人就会倒退三年左右,通过一年的工作与学习我们的知识及智慧好不容易得到了一定的提高,在过年的大吃大喝举杯豪饮吆三喝四的摧残下,这些东东全没了,而且大脑比先前的还要迟钝,有时我很希望在这个全国人民都喜气洋洋的时候,独自到一个山清水秀人烟稀少的地方净化一下灵魂,幸运的话会冒出一些wonderful ideas,说一定阿蒙就从此脱贫致富,与比哥相差无几了呢!这是一个梦,现实中我无法这样,太多的亲戚太多的朋友太多的负担,从早到晚"老蒙""阿蒙""小蒙"喊个不停,我尤其害怕回老家,想起那没完没了的饭局又苦又凉的农家酒,农村人的热情你是无法拒绝,吃完饭你还能自个儿走着回去那是相当少见的,这说明你很失败,主人也很失败,每每看到我被年轻力壮的晚辈们抬着出去,主人们才会露出满意的笑容,还不停地夸赞:够懂事够朋友够哥们有胆识有文化有前途......其实我也知道这已经成为一种习俗,我是个比较能入乡随俗的人,因为人都需要被理解与关心,我也知道他们对我很好很好,所以我必须到他们家去吃饭他们才认为我对他们好,我也看到另外的年轻人与我一样考上了大学混了个文凭在城里做事而且做得至少比我好多了,但他回村里极少参加这种饭局,而且听说有些高不可攀高深莫测,所以他在村里很不受好评,说是不懂事没礼貌没胆识没前途白读这么多年的书浪费父母血汗钱,真让我啼笑皆非,看来城市与农村的差距真是大啊,不仅仅是贫与富的差距,还有思想与文化等等

2004-1-13 15:38:57   我很少关心政治,主要是因为我不懂政治,虽然从小学到大学也没停止过政治课的学习,但那都是应付考试死记硬背,谈不上理解,更别说融会贯通了,很不幸的我偏偏在党的生日那天来到这个缤纷的世界,小时候在农村我最大的爱好是玩泥巴,也不知道有生日这种词语,记忆较为深刻的是:我经常在昏暗的煤油灯下做功课,老妈在一边摇扇子赶蚊子,老爸在另一边抽闷烟......当我知道"生日"这个词的含义时,我已经在城里读书了,尽管我依然没有能力过个生日,但在每一年的这一天,看到我们伟大的党为了自已的生日搞了很多丰富多彩的节目,我就由衷地感动与感谢,也曾不知羞耻地立志:长大后为党效力;可如今,在离三张越来越近的日子里,我发现自已的志愿越来越遥远了,大学四年我一直都认为自已思想正派态度端正语言温和举止优雅成绩优良家境贫农考试不作弊上课不睡觉按时作息按时交作业不打架斗殴与同学关关系融洽没钱谈恋爱没空打麻将,但为咱老师或党支部们总看不上我, 这对一个积极进取努力提高觉悟渴望有为的青年来说真是一次不小的人生挫折,不过我现在长大了,也明白了许多的事理,不是非得是党员了觉悟程度就高,很多人入党的目的也不是为了提高觉悟,或许是为了得到组织尽可能的照顾,谁知道呢?反正我是一个比较会自我抚慰有些阿Q精神的程序员,我赤裸裸地承认这是我的缺点弱点,也是我这么多年来一直能保持乐观的原因之一.......近日台湾那个叫阿扁的鸟人特不给我们FACES,不知疲倦地在各种场合鸡鸡歪歪的,好象一只苍蝇,不,是一堆苍蝇,我想很多的中国人包括中央领导已经有点忍无可忍了,现在就差一个理由去找阿扁算帐了,公投会不会真正地成为理由呢?我不知道。如果真干起来了，我阿蒙举双脚赞成，尽管我不是党员，但倘若组织需要，我定会赴汤蹈火在所不惜，与阿扁单挑!!!

2004-1-12 12:08:43
很多朋友在看了我写的文章或日记都对我提出了若干宝贵的意见,我很是受感动,特别感谢那些批评我的朋友,因为批评是清醒剂，是滋补品，是完善自我的苦口良药。
我相信一个人的进步除了自身努力外，离不开组织的培养和朋友们的帮助，同时在很大程度上是接受批评教育,克服缺点的结果。没有对自己缺点的觉察和认识，或者说没有接受批评改正缺点的勇气，也就找不到自己在哪些方面需要注意，哪里需要提高。
我们英明伟大的中国共产党不也是在轰轰烈烈的批评与自我批评中得到提高的吗？......
其中有些朋友说我这个人对现实总是抱有不满的态度，是一个愤世嫉俗的“愤青”，说实话对于后面一句话我很惊讶，在我的印象中这类青年是这种形象的：头发五颜六色的，穿着漏洞百出的牛仔裤，喜欢罗大佑，喜欢另类摇滚，看到PLMM就紧追不放.....
而看看我自已，短头碎发，休闲裤，面对MM就面红耳赤的，虽然也喜欢罗大佑也喜欢摇滚，但其它的差别还是很大很大，也许是我对“愤青”的概念理解得不对或不全，网上说愤青的可爱之处在于，他们承载了大多数人的悲凉和愤怒，并勇敢地说了出来。显然我离这种可爱也很远啊，我承认在我无聊的大学生涯里我学会了一些风花雪月的东东，能抱着一把破旧不堪的木吉他弹唱几首悲苦的情歌，在我百无聊赖的时候,想要加倍地百无聊赖，我就去看看小说唱唱情歌，那些岁月真是不堪回首，比如我喜欢的MM就是不喜欢我,而我不喜欢的MM就是要喜欢我，就好象肥皂剧中演的一样让人着急啊，再比如我鄙视系里XX文学社里的那些号称文学青年的男生，他们时不时写一些诗歌散文之类的来发表，他们的很多文章是由N个“啊”字组成的，我到现在还不明白他们为什么有如此丰富的感情要用这么多的“啊”，那些日子我特郁闷，因为我想不通为什么同在一个大学同吃一个食堂的饭菜，我们之间的差距就这么大呢？不过，直至今日，据我了解，那些喜欢“啊”的同学没有一个成为真正的文学青年，再一次证实我鄙视的正确性，这足够让我兴奋一些日子，当然我也没有成为，可至少我在写，只是对象由文学变成了codes,写着是快乐的，哪还管得那么多？


2004-1-11 9:07:32

  已有相当长的一段时间没有写程序了,心里感觉空荡荡的,仿佛自已落后了很长很长的一段距离,神经变得紧张了,毕竟忙惯了写惯了,突然间不忙了不写了,难免心慌心虚,就如同我含辛茹苦的母亲来这里还不到一个月的时间就闹着回家,本来我打算用CODING赚来的RMB让母亲好好地享享清福,她很不容易啊,这么多年了,为了我能完成学业从来就没有停止过忙碌,脸上的皱纹比城里的同龄人不知深了多少倍,我每每凝望母亲的那张历尽沧桑的脸,心灵深处酸酸的,也决定日后要让她享福,哪怕不娶LP,哪怕自已再大的辛苦......
可母亲来城里还不到一个月就闹着回老家,她说这里的路太多太乱这里的车太大太快这里的人太怪太冷这里的邻居象陌生人这里的房子象鸟笼......这一系列简简单单的描述让我哑口无言,确实母亲忙碌惯了串门惯了,现在让她享福让她清闲让她一天到晚呆在家里确实是很过份的......人的一生大部分的时间都在强迫自已不断地去适应各种不同的环境各种不同的人,这些本领我认为是在我们整个读书的过程中学到的,我无心抨击我国的教育制度,但我还是想列举一些观点:

(1)我国注重严进宽出(听说美国注重宽进严出),这就造出中国部分大学生(包括我,:))形成了"混"的思想;
(2)我国注重基础,不注重创造性思维的培养;
(3)我国课时长,讲课难;
(4)我国的考试直接反映课堂内容,培养了太多死记硬背的能力;
(5)我国学生专业知识较深,但知识面不广......

这种环境培养出来的人才,通常是:每个人都有雄心状志,学习与适应新环境的能力很强,脚踏实地,实事求是,基础扎实,讲纪律讲服从很听话,一般老板让做什么就做什么,但往往创新精神不足,做事缺少主动性,需要别人安排,很少主动去做,对许多事都没有主见,或者有主见但不想说,不直说;对最新的知识不够了解,不太善于与人交流,一个闷头苦干,缺乏合作精神......

2004-1-8 12:59:18

 昨晚终于看了冯小刚的<<手机>>,看完后真想大骂一场,但不知骂谁,小冯说到底是个商人,商人看重的是商业利益,至于故事情节等等这些玩意就随随便便地糊弄一下老百姓,因此小冯是骂不得的,也没胆量骂,看人家那嘴皮子可利害了,我等那敢班门弄斧啊......感觉除了婚外恋,除了耍嘴皮子,这片子就没什么可看的,网上有一朋友总结观后感时特别强调在观看本片时要注意以下事项：
1、 宜与GF、同龄亲戚同事朋友同观，后者犹宜。
2、 不宜与媳妇儿、二奶、情妇同观。
3、 宜观后再读俺的屎作。
4、 宜观后再读俺的屎作再回俺的贴。


2004-1-7 16:50:44      [==发表评论==]
 我每天都收到很多支持VCHOME的朋友们写来的EMAIL,我一般情况下都会回信,可很多情况下回复的内容都是一样的,因为很多的朋友都在问我如何学好编程或如何成为优秀的程序员等等诸如此类的问题,坦白地说面对这种问题我很难作出恰当的答复,网上书里有太多相关的文章,但我们能照搬吗?每个人都有自已的特点及优势,并且学好编程或成为优秀的程序员也不是三天两夜就可达到,这其间还与个人的恒心与毅力有关,我觉得无论做什么事哪怕是鸡毛蒜皮的事,我们都应该很细心应该精益求精,人无论在什么时候都应该有明确的目标,才不至于茫茫然的......

2004-1-6 17:31:26      [==发表评论==]
 每天上下班都经过海边经过情侣路,现在看海已经没有多余的感受,用现在流行的说法是我对大海产生了审美上的疲劳,珠海是个人少树多的城市,尽管这里没有大公司没有知名的外企,但每每看到成双成对的情侣在海边慢悠悠地踱着,我的心就变得特别的宁静,我也曾经豪情万丈也曾经渴望波涛汹涌的自由也曾经离开这个城市,可现在我还是回来了,原因很多很多,但有一点是:习惯了这里的干净与安静就无法容忍别的城市的肮脏与喧嚣......其实在哪里都是生活,钱多钱少都要生活,每个人都有自已生活的态度及想法,我只是说了自已的而已,怨我孤陋寡闻,或许外面还有比这里更美更静的地方!

2004-1-5 12:21:52      [==发表评论==]
 很久没有看CCTV了,昨晚上鬼使神差地看了,而且是凑巧碰上好玩的场面,赵本山的学生，在电视剧《刘老根》中出演“二柱子”的张小飞和“大胖”的贺美龄两位演员上台表演“二人转",中途因“格调不高”被节目组紧急叫停，节目没演完两人就被“赶”下台,随后赵本山上台发泄了自己的不满：“我知道这是中央电视台，但也别这样，让人家演完再说啊。”......这事真让人不好说话,支持谁仿佛都有一大堆的理由, 不过我还是很佩服赵爷的,敢做敢说,总比一些满面笑容心里却无比苦闷的人好些......那只不过是一场戏,既然是戏,就别管它是低级趣味还是高级趣味了,大到电视连续剧或一部电影,小到一个小品或一次即兴表演,都应有好人与坏人,低级趣味与高级趣味,要不总是看好人看高级的多无聊多沉闷啊......我对CCTV的某些节目某些主持人一直都不能容忍的,比如得姜同志僵硬的表情、冷冷的言语及贫乏的文字解说，都暴露了其文化素质及个人涵养方面的不足,还有一些很喜欢煽情的老奶奶老爷爷们,好象不让全国人民泪流直下她们绝不罢休,我不知别人的感受如何,我每每听到了都全身起鸡皮疙瘩,三天之内胃口失调


2004-1-5 10:12:48      [==发表评论==]
 我希望2004年是个平安的一年,多几个熊德明,不再有SARS,不再有类似孙志刚事件,2003年已经让我们疲惫不堪,我后悔在过去的一年中没有记录下自已的一些感受,现在依靠回忆来抒情显得有些矫揉造作,其实有时细想,生命确实太过于脆弱,没有人知道未来会怎样,别以为在每一年的CCTV春节联欢晚会你看到的尽是穿红戴绿敲锣打鼓喜气洋洋欣欣向荣的景气,你就以为全国人民都过上了幸福美满的生活,实际上这些景象有可能可以蒙一下部分城里长大的人们,因为他有可能不知道很多很多,如果有机会,你去广州火车站看看,去深圳的工业区走走(注意如果要体验被抢,请在包里少放钱多放几块石头),在我们大fish大肉吃喝玩乐的时候,你是否想起过此时此刻有些人在饿着.......写是这样写,我也很少想过那么多,因为我毕竟也没有那么崇高,我就有点象钟南山所说的:做好自己的本职工作，就是最大的政治!

2004-1-2 17:13:34      [==发表评论==]
 去年是一个不幸的年份,太多的灾难太多的事故,让我们心力都有些疲惫,有时我很想写一下去年的总结,只是每次触摸硬梆梆的键盘就什么灵感什么文字都消失了,于是认为真正爬格子的人是不会用PC去写东东的, 当然不排除冒进的年经人会这样比如卫慧棉棉安妮BABY之类的,有些人都能用身体写作了,用一下键盘不就是小CASE吗?有时我以为自已真的老了,离这个社会越来越远,别人都在说身体啊性爱啊毒品啊......而我还在不停地CODING,难怪赵本山爷爷会说:同在一个社会,差距怎么这么大呢? 不过这没什么, 林子大了,什么鸟都会有的,每个人都有自已的角色,我CODING是为了生活,别人用身体写作不也是为了生活吗?
2003年有些东东有些人是值得我们记住: SARS, 杨利伟,闾丘露薇,钟南山,
丁磊,张国荣,梅艳芳,拉丹,萨达姆,无间道,木子美,陈忠和,布什......

2004-1-2 14:16:25      [==发表评论==]
 很多的朋友也许很看不惯我的这一举动---写日记, 毕竟都快三张了,还在这里发什么闷骚啊,没事就回家洗了睡了......其实阿蒙是一个容易冲动容易满足比较随意的人,我不敢下什么决心强迫自已每一天都在这写上那么一段,但是在我想写的时候我就能在这里乱乱地不受约束地写,就这么简单,就好象如果你想喝酒你就去酒吧喝个够,倘若在喝之前你就先去想喝多了对身体不好回家被父母骂明天起不来上班等N多问题,那说明你活得很累,你需要调整一下你的心态,不然久了多了会爆炸的,:)......又开始离题了,继续说日记,就如同回到那遥远的过去,用心良苦的老爸老妈老师们教导年少的我们要养成每天写日记的习惯,并罗列一串又一串的益处,在我模糊的记忆中,隐隐约约地泛滥着一篇又一篇流水帐一样的小文章,那时的我坚定不移地认为:只要我坚持总有一天我的作文会及格! 好象有个伟人说过:时间是检验真理的唯一标准!我一年又一年地长大,日记一本又一本地堆积,可我的作文成绩依然不堪入目,在我开始怀疑这种教育的可行性时,我已经成为一个大学生,中国的大学想必读过大学的大部分的朋友也理解,那是一个说不清道不明的机构,我整个人就象做一个长梦,四年后醒了,也就毕业了,既然是梦,就应是虚幻的,梦里应是做不了学不到什么实际性的东东,当然这可能与我所在的不是名牌大学有关,但名牌大学的学生难道学的不是那些玩意吗,我现在开始知道,学的东东都差不多,可能方法不同而已,又离题了,算了不写了!
     </div>
    <div @click="back">点击返回列表页</div>
   </div>
</template>

<script>
  export default {
    methods: {
      back () {
        window.history.back()
      }
    }

  }
</script>

<style scoped="scoped">
  .history-index ul li{
    height: 500px
  }
</style>